000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.  HELLOWRD.
000300 AUTHOR.      MAINFRAME DEV.
000400*----------------------------------------------------------------*
000500* A SIMPLE COBOL PROGRAM FOR GITHUB & VS CODE PIPELINE TESTING.
000600*----------------------------------------------------------------*
000700 ENVIRONMENT DIVISION.
000800 CONFIGURATION SECTION.
000900
001000 DATA DIVISION.
001100 WORKING-STORAGE SECTION.
001200 01  WS-USER-DATA.
001300     05  WS-NAME           PIC X(20) VALUE 'DEV USER'.
001400     05  WS-COUNTER        PIC 9(02) VALUE 00.
001500
001600 PROCEDURE DIVISION.
001700 0100-MAIN-LOGIC.
001800     DISPLAY '=================================================='.
001900     DISPLAY '  EXECUTING MAINFRAME VS CODE / GITHUB TEST JCL   '.
002000     DISPLAY '=================================================='.
002100     
002200     PERFORM 0200-LOOP-PROCESS THRU 0200-EXIT-PROCESS 3 TIMES.
002300     
002400     DISPLAY 'TEST COMPLETED SUCCESSFULY.'.
002500     STOP RUN.
002600
002700 0200-LOOP-PROCESS.
002800     ADD 1 TO WS-COUNTER.
002900     DISPLAY 'HELLO, ' WS-NAME ' | REPETITION NUMBER: ' WS-COUNTER.
003000
003100 0200-EXIT-PROCESS.
003200     EXIT.